Lab6Ruby(RoR Proj)/MachineApp/app/controllers/machines_controller.rb

    def index
      @machines = Machine.all
      @total_downtime = Machine.sum(:downtime)
      @machines_without_downtime = Machine.where(downtime: 0)
      @relative_downtime_all = Machine.all.map { |machine| [machine.name, (machine.downtime.to_f / machine.uptime) * 100] }.to_h
---
SELECT "machines".* FROM "machines"
SELECT SUM("machines"."downtime") FROM "machines"

    def create
      @machine = Machine.new(machine_params)
      if @machine.save
---
INSERT INTO "machines" ("name", "downtime", "uptime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Cutter"], ["downtime", 0], ["uptime", 300], ["created_at", "2023-11-28 12:19:18.498426"], ["updated_at", "2023-11-28 12:19:18.498426"]]

    def update
      if @machine.update(machine_params)
---
UPDATE "machines" SET "uptime" = ?, "updated_at" = ? WHERE "machines"."id" = ?  [["uptime", 240], ["updated_at", "2023-11-28 12:24:06.164769"], ["id", 3]]

    def set_machine
      @machine = Machine.find(params[:id])
---
SELECT "machines".* FROM "machines" WHERE "machines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]